export const informationEngineering =
  "数理・情報システム学科（情報工学コース）";

export default {
  english: 4, //英語
  foreignLanguage: 4, //初修
  artCulture: 2, //芸術文化
  informationScience: 2, //情報科学
  social: 4, //人文社会科学
  science: 4, //自然科学
  educationOthers: 6, //教養育成その他
  freeFirst: 10, //自由選択Ⅰ
  specialFundamental: 12, //専門基礎
  specialCompulsory: 32, //専門必修
  specialOptional: 30, //専門選択
  specialFree: 8, //専門自由
  freeSecond: 6 //自由選択Ⅱ
};

export const informationEngineeringRequired = [
  "アルゴリズムとデータ構造",
  "計算機アーキテクチャＩ",
  "オペレーティングシステム",
  "コンピュータネットワーク",
  "ソフトウェア工学",
  "コンピュータサイエンス基礎",
  "Ｃプログラミング応用演習",
  "ＪＡＶＡプログラミング演習",
  "計算機工学実験Ａ",
  "計算機工学Ｂ",
  "基礎データ構造演習",
  "コンピュータサイエンス講究",
  "コンピュータサイエンス研究実習",
  "情報処理演習",
  "卒業研究"
];

export const informationEngineeringElects = [
  "代数学入門Ｉ",
  "代数学入門II",
  "幾何学入門ＩＡ",
  "幾何学入門IIＢ",
  "位相幾何学入門Ｉ",
  "位相幾何学入門II",
  "数理構造演習セミナーＩＡ",
  "数理構造演習セミナーＩＢ",
  "数理構造演習セミナーIIＡ",
  "数理構造演習セミナーIIＢ",
  "代数学Ｉ",
  "代数学II",
  "幾何学Ｉ",
  "幾何学II",
  "位相数学Ｉ",
  "位相数学II",
  "代数と組合せ",
  "情報幾何",
  "位相構造",
  "数理構造特論Ｉ",
  "数理構造特論II",
  "数理構造特論III",
  "解析学入門ＩＡ",
  "解析学入門IIＡ",
  "数理解析演習セミナーＩＡ",
  "数理解析演習セミナーＩＢ",
  "数理解析演習セミナーIIＡ",
  "数理解析演習セミナーIIＢ",
  "計算数学Ｉ",
  "計算数学II",
  "数理統計学Ｉ",
  "数理統計学II",
  "解析学Ｉ",
  "解析学II",
  "複素解析学Ｉ",
  "複素解析学II",
  "実解析学",
  "非線形現象とシュミレーション",
  "データ科学システム論",
  "関数解析とシステム制御",
  "数理解析特論Ｉ",
  "数理解析特論II",
  "数理解析特論III",
  "数学要論ＩＡ",
  "数学要論ＩＢ",
  "数学要論IIＡ",
  "数学要論IIＢ",
  "線形代数学",
  "基礎解析学Ｉ",
  "基礎解析学II",
  "マルチメディア数学I",
  "マルチメディア数学II",
  "数学輪講",
  "数学海外演習",
  "情報数学Ｉａ",
  "情報数学Ｉｂ",
  "情報数学II",
  "情報数学III",
  "並列・分散システム",
  "シュミレーション工学",
  "コンピュータセキュリティ",
  "記号論理学",
  "データベースの設計と開発",
  "人工知能",
  "応用情報学特論Ｉ",
  "応用情報学特論II",
  "応用情報学特論III",
  "ヒューマン・コンピュータ・インスタラクション",
  "アルゴリズムとデータ構造",
  "計算機アーキテクチャＩ",
  "計算機アーキテクチャII",
  "計算機アーキテクチャ",
  "オペレーティングシステム",
  "オートマトンと計算理論",
  "コンピュータネットワーク",
  "プログラミング言語と処理系",
  "ソフトウェア工学",
  "マルチメディア工学",
  "計算機科学特論Ｉ",
  "計算機科学特論II",
  "計算機科学特論III",
  "情報と産業・社会",
  "情報システムと職業倫理",
  "マルチメディア演習",
  "システム創成プロジェクトI",
  "基礎情報技術英語",
  "情報処理技術特論",
  "ＩＴ産業論", //直打ち
  "ＩＴシステム開発論", //直打ち
  "卒業研究"
];
